[
  {
    "slug": "ozo",
    "title": "Ozo Trading Library",
    "description": "A Python library designed for algorithmic trading and quantitative finance. Provides tools for backtesting trading strategies, data analysis, and market simulation.",
    "longDescription": "Ozo is a comprehensive Python toolkit for traders and quantitative analysts. It offers robust backtesting capabilities, data manipulation utilities, and statistical analysis tools to develop and validate trading strategies before deploying them in live markets.",
    "tech": ["Python", "NumPy", "Pandas", "Financial Analysis"],
    "category": "Python",
    "github": "https://github.com/zakariab0/ozo",
    "demo": null,
    "image": "/projects/ozo.png",
    "featured": true,
    "year": 2024,
    "status": "active"
  },
  {
    "slug": "basic-blockchain",
    "title": "Basic Blockchain Implementation",
    "description": "Educational blockchain demonstration built in Java, showcasing fundamental concepts of distributed ledger technology, proof-of-work, and chain validation.",
    "longDescription": "A Java-based blockchain implementation that demonstrates core concepts including block creation, cryptographic hashing, chain validation, and consensus mechanisms. Designed as an educational tool to understand blockchain architecture from first principles.",
    "tech": ["Java", "Cryptography", "Data Structures", "Distributed Systems"],
    "category": "Java",
    "github": "https://github.com/zakariab0/Basic_Blockchain",
    "demo": null,
    "image": "/projects/blockchain.png",
    "featured": true,
    "year": 2023,
    "status": "completed"
  },
  {
    "slug": "inventory-management",
    "title": "Inventory Management System",
    "description": "Enterprise-grade inventory management application built with Spring Boot and PostgreSQL. Features comprehensive CRUD operations, reporting, and real-time stock tracking.",
    "longDescription": "Full-stack inventory management solution designed for warehouse operations. Includes advanced features like low-stock alerts, transaction history, supplier management, and customizable reporting. Built with Spring Boot backend and modern frontend, deployed with Docker.",
    "tech": ["Spring Boot", "PostgreSQL", "Spring Data JPA", "REST API", "Docker"],
    "category": "Java",
    "github": "https://github.com/zakariab0/inventory-managment",
    "demo": null,
    "image": "/projects/inventory.png",
    "featured": true,
    "year": 2024,
    "status": "active"
  },
  {
    "slug": "product-management-ocp",
    "title": "Product Management Application",
    "description": "PHP-based product management system developed as a coding challenge demonstration. Implements OCP (Open-Closed Principle) design patterns and clean architecture.",
    "longDescription": "A demonstration project showcasing SOLID principles in PHP development, particularly the Open-Closed Principle. Features extensible product catalog management, category hierarchies, and modular architecture that allows easy extension without modifying existing code.",
    "tech": ["PHP", "Object-Oriented Design", "Design Patterns", "Clean Architecture"],
    "category": "PHP",
    "github": "https://github.com/zakariab0/Product-Management-Application",
    "demo": null,
    "image": "/projects/product-management.png",
    "featured": false,
    "year": 2023,
    "status": "completed"
  },
  {
    "slug": "fleet-management-sorec",
    "title": "Fleet Management System (SOREC)",
    "description": "Comprehensive fleet management application developed during my end-of-studies internship at SOREC. Manages vehicle tracking, maintenance schedules, and driver assignments.",
    "longDescription": "Enterprise application built for Société Royale d'Encouragement du Cheval to manage their vehicle fleet. Features include vehicle inventory, maintenance tracking, fuel consumption analysis, driver management, and automated scheduling. Implemented with Spring Boot microservices, Angular frontend, and CI/CD pipeline.",
    "tech": ["Spring Boot", "Angular", "PostgreSQL", "JWT", "Docker", "Jenkins"],
    "category": "Java",
    "github": null,
    "demo": null,
    "image": "/projects/fleet-management.png",
    "featured": true,
    "year": 2024,
    "status": "completed",
    "private": true
  },
  {
    "slug": "patient-management-chp",
    "title": "Patient Records Management System",
    "description": "Hospital patient records management system developed with Symfony. Handles patient data, medical histories, appointments, and document management.",
    "longDescription": "Healthcare application built for Centre Hospitalier Provincial to digitize patient record management. Includes secure patient data storage, appointment scheduling, medical history tracking, and document management with role-based access control. Compliant with healthcare data privacy standards.",
    "tech": ["PHP", "Symfony", "MySQL", "Bootstrap", "Doctrine ORM"],
    "category": "PHP",
    "github": null,
    "demo": null,
    "image": "/projects/patient-management.png",
    "featured": false,
    "year": 2022,
    "status": "completed",
    "private": true
  }
]
